loliweive/stm32-oop/src/display/ssd1306.c
/**
 * @file    ssd1306.c
 * @brief   SSD1306 I2C 驱动实现
 */
#include "ssd1306.h"
#include "i2c.h"
#include <string.h>

/* ── I2C 发送命令/数据 ─────────────────────────────────── */
static void _send_cmd(SSD1306 *oled, uint8_t cmd)
{
    uint8_t buf[2] = {0x00, cmd};  /* Co=0, D/C#=0 → 命令 */
    i2c_write((I2cPort *)NULL, 0, buf, 0);  /* 占位 — 用低层 */
    /* 直接 I2C 写 (绕过 i2c_port 封装) */
    extern bool i2c_write_raw(void *i2c, uint8_t addr, const uint8_t *data, size_t len);
    i2c_write_raw(oled->i2c, oled->addr, buf, 2);
}

static void _send_data(SSD1306 *oled, const uint8_t *data, size_t len)
{
    /* SSD1306 数据模式: 控制字节 = 0x40 */
    /* 分批发送 (I2C 单次最多约 256 字节) */
    for (size_t i = 0; i < len; i += 128) {
        size_t chunk = (len - i > 128) ? 128 : (len - i);
        uint8_t buf[129];
        buf[0] = 0x40;  /* Co=0, D/C#=1 → 数据 */
        memcpy(buf + 1, data + i, chunk);
        extern bool i2c_write_raw(void *i2c, uint8_t addr, const uint8_t *data, size_t len);
        i2c_write_raw(oled->i2c, oled->addr, buf, chunk + 1);
    }
}

/* ── 低层 I2C 写 ────────────────────────────────────────── */
/* 绕过 i2c.h 封装, 直接操作寄存器 */
#include "stm32f103xb.h"
bool i2c_write_raw(void *i2c, uint8_t addr, const uint8_t *data, size_t len)
{
    I2C_Type *i = (I2C_Type *)i2c;

    /* START */
    i->CR1 |= I2C_CR1_START;
    uint32_t to = 100000;
    while (!(i->SR1 & I2C_SR1_SB) && --to) {}
    if (!to) return false;

    /* ADDR (write) */
    i->DR = (uint8_t)(addr << 1);
    to = 100000;
    while (!(i->SR1 & I2C_SR1_ADDR) && --to) {}
    (void)i->SR2; /* clear ADDR */

    /* DATA */
    for (size_t n = 0; n < len; n++) {
        to = 100000;
        while (!(i->SR1 & I2C_SR1_TXE) && --to) {}
        i->DR = data[n];
    }

    /* STOP */
    i->CR1 |= I2C_CR1_STOP;
    return true;
}

/* ── 初始化序列 ─────────────────────────────────────────── */

void ssd1306_init(SSD1306 *oled, void *i2c, uint8_t addr)
{
    oled->i2c  = i2c;
    oled->addr = addr;
    memset(oled->framebuf, 0, sizeof(oled->framebuf));

    /* 初始化命令序列 */
    uint8_t init_cmds[] = {
        0xAE,        /* Display OFF */
        0xD5, 0x80,  /* Clock div */
        0xA8, 0x3F,  /* MUX = 64 */
        0xD3, 0x00,  /* Display offset */
        0x40,        /* Start line */
        0x8D, 0x14,  /* Charge pump */
        0x20, 0x00,  /* Horizontal addressing */
        0xA1,        /* Segment remap */
        0xC8,        /* COM scan direction */
        0xDA, 0x12,  /* COM pins */
        0x81, 0xCF,  /* Contrast */
        0xD9, 0xF1,  /* Precharge */
        0xDB, 0x40,  /* VCOMH */
        0xA4,        /* Display ON (resume) */
        0xA6,        /* Normal display (not inverted) */
        0x2E,        /* Deactivate scroll */
        0xAF,        /* Display ON */
    };
    for (size_t i = 0; i < sizeof(init_cmds); i++) {
        _send_cmd(oled, init_cmds[i]);
    }
}

void ssd1306_clear(SSD1306 *oled)
{
    memset(oled->framebuf, 0, sizeof(oled->framebuf));
}

void ssd1306_flush(SSD1306 *oled)
{
    /* 设置写入区域: 全部页 */
    _send_cmd(oled, 0x21); _send_cmd(oled, 0); _send_cmd(oled, 127); /* 列 0-127 */
    _send_cmd(oled, 0x22); _send_cmd(oled, 0); _send_cmd(oled, 7);   /* 页 0-7 */

    _send_data(oled, oled->framebuf, sizeof(oled->framebuf));
}

/* ── 绘图 ──────────────────────────────────────────────── */

void ssd1306_pixel(SSD1306 *oled, uint8_t x, uint8_t y, bool on)
{
    if (x >= SSD1306_WIDTH || y >= SSD1306_HEIGHT) return;
    uint16_t idx = x + (y / 8) * SSD1306_WIDTH;
    if (on) oled->framebuf[idx] |=  (1 << (y & 7));
    else    oled->framebuf[idx] &= ~(1 << (y & 7));
}

void ssd1306_hline(SSD1306 *oled, uint8_t x, uint8_t y, uint8_t w)
{
    for (uint8_t i = 0; i < w; i++) ssd1306_pixel(oled, x + i, y, true);
}

void ssd1306_fill_rect(SSD1306 *oled, uint8_t x, uint8_t y, uint8_t w, uint8_t h, bool on)
{
    for (uint8_t j = 0; j < h; j++)
        for (uint8_t i = 0; i < w; i++)
            ssd1306_pixel(oled, x + i, y + j, on);
}

/* ── 5×7 字体 ──────────────────────────────────────────── */
static const uint8_t font5x7[96][5] = {
    {0x00,0x00,0x00,0x00,0x00}, /* space */
    {0x00,0x00,0x5F,0x00,0x00}, /* ! */
    {0x00,0x07,0x00,0x07,0x00}, /* " */
    {0x14,0x7F,0x14,0x7F,0x14}, /* # */
    {0x24,0x2A,0x7F,0x2A,0x12}, /* $ */
    {0x23,0x13,0x08,0x64,0x62}, /* % */
    {0x36,0x49,0x55,0x22,0x50}, /* & */
    {0x00,0x05,0x03,0x00,0x00}, /* ' */
    {0x00,0x1C,0x22,0x41,0x00}, /* ( */
    {0x00,0x41,0x22,0x1C,0x00}, /* ) */
    {0x08,0x2A,0x1C,0x2A,0x08}, /* * */
    {0x08,0x08,0x3E,0x08,0x08}, /* + */
    {0x00,0x50,0x30,0x00,0x00}, /* , */
    {0x08,0x08,0x08,0x08,0x08}, /* - */
    {0x00,0x60,0x60,0x00,0x00}, /* . */
    {0x20,0x10,0x08,0x04,0x02}, /* / */
    {0x3E,0x51,0x49,0x45,0x3E}, /* 0 */
    {0x00,0x42,0x7F,0x40,0x00}, /* 1 */
    {0x42,0x61,0x51,0x49,0x46}, /* 2 */
    {0x21,0x41,0x45,0x4B,0x31}, /* 3 */
    {0x18,0x14,0x12,0x7F,0x10}, /* 4 */
    {0x27,0x45,0x45,0x45,0x39}, /* 5 */
    {0x3C,0x4A,0x49,0x49,0x30}, /* 6 */
    {0x01,0x71,0x09,0x05,0x03}, /* 7 */
    {0x36,0x49,0x49,0x49,0x36}, /* 8 */
    {0x06,0x49,0x49,0x29,0x1E}, /* 9 */
    {0x00,0x36,0x36,0x00,0x00}, /* : */
    {0x00,0x56,0x36,0x00,0x00}, /* ; */
    {0x00,0x08,0x14,0x22,0x41}, /* < */
    {0x14,0x14,0x14,0x14,0x14}, /* = */
    {0x41,0x22,0x14,0x08,0x00}, /* > */
    {0x02,0x01,0x51,0x09,0x06}, /* ? */
    {0x3E,0x41,0x5D,0x55,0x1E}, /* @ */
    {0x7E,0x11,0x11,0x11,0x7E}, /* A */
    {0x7F,0x49,0x49,0x49,0x36}, /* B */
    {0x3E,0x41,0x41,0x41,0x22}, /* C */
    {0x7F,0x41,0x41,0x22,0x1C}, /* D */
    {0x7F,0x49,0x49,0x49,0x41}, /* E */
    {0x7F,0x09,0x09,0x01,0x01}, /* F */
    {0x3E,0x41,0x41,0x51,0x32}, /* G */
    {0x7F,0x08,0x08,0x08,0x7F}, /* H */
    {0x00,0x41,0x7F,0x41,0x00}, /* I */
    {0x20,0x40,0x41,0x3F,0x01}, /* J */
    {0x7F,0x08,0x14,0x22,0x41}, /* K */
    {0x7F,0x40,0x40,0x40,0x40}, /* L */
    {0x7F,0x02,0x04,0x02,0x7F}, /* M */
    {0x7F,0x04,0x08,0x10,0x7F}, /* N */
    {0x3E,0x41,0x41,0x41,0x3E}, /* O */
    {0x7F,0x09,0x09,0x09,0x06}, /* P */
    {0x3E,0x41,0x51,0x21,0x5E}, /* Q */
    {0x7F,0x09,0x19,0x29,0x46}, /* R */
    {0x46,0x49,0x49,0x49,0x31}, /* S */
    {0x01,0x01,0x7F,0x01,0x01}, /* T */
    {0x3F,0x40,0x40,0x40,0x3F}, /* U */
    {0x1F,0x20,0x40,0x20,0x1F}, /* V */
    {0x7F,0x20,0x18,0x20,0x7F}, /* W */
    {0x63,0x14,0x08,0x14,0x63}, /* X */
    {0x03,0x04,0x78,0x04,0x03}, /* Y */
    {0x61,0x51,0x49,0x45,0x43}, /* Z */
    {0x3E,0x41,0x41,0x41,0x3E}, /* [ actually 0 */
    {0x04,0x08,0x10,0x20,0x40}, /* \ */
    {0x7F,0x40,0x40,0x40,0x00}, /* ] actually | */
    {0x02,0x01,0x02,0x00,0x00}, /* ^ */
    {0x40,0x40,0x40,0x40,0x40}, /* _ */
    {0x00,0x01,0x02,0x04,0x00}, /* ` */
    {0x20,0x54,0x54,0x54,0x78}, /* a */
    {0x7F,0x48,0x44,0x44,0x38}, /* b */
    {0x38,0x44,0x44,0x44,0x20}, /* c */
    {0x38,0x44,0x44,0x48,0x7F}, /* d */
    {0x38,0x54,0x54,0x54,0x18}, /* e */
    {0x08,0x7E,0x09,0x01,0x02}, /* f */
    {0x08,0x14,0x54,0x54,0x3C}, /* g */
    {0x7F,0x08,0x04,0x04,0x78}, /* h */
    {0x00,0x44,0x7D,0x40,0x00}, /* i */
    {0x20,0x40,0x44,0x3D,0x00}, /* j */
    {0x7F,0x10,0x28,0x44,0x00}, /* k */
    {0x00,0x41,0x7F,0x40,0x00}, /* l */
    {0x7C,0x04,0x18,0x04,0x78}, /* m */
    {0x7C,0x08,0x04,0x04,0x78}, /* n */
    {0x38,0x44,0x44,0x44,0x38}, /* o */
    {0x7C,0x14,0x14,0x14,0x08}, /* p */
    {0x08,0x14,0x14,0x18,0x7C}, /* q */
    {0x7C,0x08,0x04,0x04,0x08}, /* r */
    {0x48,0x54,0x54,0x54,0x20}, /* s */
    {0x04,0x3F,0x44,0x40,0x20}, /* t */
    {0x3C,0x40,0x40,0x20,0x7C}, /* u */
    {0x1C,0x20,0x40,0x20,0x1C}, /* v */
    {0x3C,0x40,0x30,0x40,0x3C}, /* w */
    {0x44,0x28,0x10,0x28,0x44}, /* x */
    {0x0C,0x50,0x50,0x50,0x3C}, /* y */
    {0x44,0x64,0x54,0x4C,0x44}, /* z */
};

void ssd1306_char(SSD1306 *oled, uint8_t x, uint8_t page, char c)
{
    if (page >= SSD1306_PAGES || x > SSD1306_WIDTH - 6) return;
    if (c < 32 || c > 127) c = ' ';
    const uint8_t *glyph = font5x7[c - 32];
    for (int i = 0; i < 5; i++) {
        oled->framebuf[x + i + page * SSD1306_WIDTH] = glyph[i];
    }
    /* 列间距 */
    oled->framebuf[x + 5 + page * SSD1306_WIDTH] = 0;
}

void ssd1306_text(SSD1306 *oled, uint8_t x, uint8_t page, const char *str)
{
    uint8_t col = x;
    while (*str) {
        if (col > SSD1306_WIDTH - 6) { col = 0; page++; }
        if (page >= SSD1306_PAGES) break;
        ssd1306_char(oled, col, page, *str++);
        col += 6;
    }
}

/* ── 传感器数据专用显示 ────────────────────────────────── */

void ssd1306_show_sensor(SSD1306 *oled, const char *title,
                         const char *line1, const char *line2)
{
    ssd1306_clear(oled);

    /* 标题栏 (反白) */
    ssd1306_fill_rect(oled, 0, 0, 128, 10, true);
    ssd1306_text(oled, 2, 0, title);  /* 需要反白显示... 简化: 先画标题 */
    /* 分隔线 */
    ssd1306_hline(oled, 0, 11, 128);
    ssd1306_hline(oled, 0, 12, 128);

    /* 数据行 */
    if (line1) ssd1306_text(oled, 0, 2, line1);
    if (line2) ssd1306_text(oled, 0, 4, line2);

    ssd1306_flush(oled);
}
